LEXICON_RU: dict[str, str] = {
    '/start': 'Привет! Я – бот, который парсит вакансии дата аналитика и присылает тебе их, '
    'если найдет новую. Напишите «начать», если хотите, чтобы я начал поиск, '
    'или «помощь», если хотите узнать, что я умею. Также могу сразу вывести 10 последних вакансий. '
    'Для этого напишите "да".',
    '/help': 'Я осуществляю поиск вакансий дата аналитиков и смежных вакансий на сайте hh.ru '
    'и присылаю их тебе, если они появляются. Для того, чтобы начать поиск, напиши (или выбери в меню) /start. '
    'Также с помощью моделей машинного обучения я определяю грейды вакансий и примерную разплату, '
    'если она не указана в вакансии.'
    '/subscribe - Подписаться на рассылку, /unsubscribe - Отписаться от рассылки, /status - статус подписки, '
    '/set_interval 15 - Установить интервал обновления (в минутах), например 15.',
    'начать': 'Отлично! Я начал поиск вакансий. Если хотите узнать, что я умею, напишите /help.',
    'да': 'Вот вакансии',
    'нет': 'Пока тут пусто.',
    'another': 'Я вас не понял, попробуйте еще раз.'
               
}

LEXICON_COMMANDS: dict[str, str] = {
    '/start': 'Начало работы с ботом',
    '/help': 'Вывести справку',
    '/subscribe': 'Подписаться на рассылку',
    '/unsubscribe': 'Отписаться от рассылки',
    '/status': 'Посмотреть статус подписки',
    '/set_interval': 'Установить интервал обновления (нужно добавить число в минутах)',
}